"""
算数运算符
+ 加
- 减
* 乘
/ 除
// 整除
% 取余
** 幂
"""
print(1+1)
print(1-1)
print(1*1)
print(1/1)
print(1//1)
print(1%1)
print(1**1)

"""
赋值运算符
 = 基本赋值运算 将一个表达式赋值给一个变量
 += 加赋值
 -= 减赋值
 *= 乘赋值
 /= 除赋值
 //= 取整赋值
 %= 取余赋值
 **= 幂赋值
"""
a = 1
b = c =2
a += 1
a -= 1
a *= 1
a /= 1
a //= 1
a %= 1
a **= 1

"""
比较运算符（关系运算符）用于对常量、变量或表达式结果进行比较，真True，假Flase
> 大于
< 小于
== 等于
>= 大于等于
<= 小于等于
!= 不等于
is 引用对象是否相同
is not 引用对象是否不同

== 和 is区别
== 用来比较两个变量是否相等， is 用来比较两个变量引用是否是同一个对象
"""
print(a > b)
print(a < b)
print(a == b)
print(a >= b)
print(a <= b)
print(a != b)
print(a is b)
print(a is not b)

"""
逻辑运算符
"""